lectures/lect-01.tex
% Created 2015-01-21 Wed 10:47
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Lecture 01 Notes}
\author{Derek Harter}
\date{2015-01-20}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Lecture 01 Notes.},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\section*{Install Visual Studio}
\label{sec-1}
\section*{Set Parameters (tabs)}
\label{sec-2}
\section*{First Program in C++ (Hello World)}
\label{sec-3}

\begin{itemize}
\item Program Header
\item main function documentation
\item explain line by line
\item compile
\end{itemize}
\section*{Escape Characters}
\label{sec-4}
\section*{cout and cin}
\label{sec-5}

\begin{itemize}
\item namespace resolution
\end{itemize}
\section*{Adding integers (example of input)}
\label{sec-6}
\section*{Variables, types, memory}
\label{sec-7}
\section*{Arithmetic operations, operater order of precedence}
\label{sec-8}

\begin{itemize}
\item modulus
\end{itemize}
\section*{Relational operators, boolean types, Equality}
\label{sec-9}

\end{document}
